content/provd/sequence-diagram.mmd
sequenceDiagram
    participant phone
    participant asterisk
    participant agid
    participant confd
    participant auth
    participant provd
    participant amid

    phone->>asterisk: prov code
    asterisk->>agid: device IP and prov code
    agid->>confd: token, get device from IP
    confd->>auth: validate token
    auth->>confd: allow
    confd->>agid: device
    agid->>confd: token, get line from prov code
    confd->>auth: validate token
    auth->>confd: allow
    confd->>agid: line
    agid->>confd: token, associate line with device
    confd->>auth: validate token
    auth->>confd: allow
    confd->>provd: token, update device
    provd->>auth: validate token
    auth->>provd: allow
    provd->>confd: ok
    confd->>provd: token, synchronize device
    provd->>auth: validate token
    auth->>provd: allow
    provd->>confd: ok
    confd->>agid: ok
    provd->>amid: synchronize device
    amid->>asterisk: synchronize device
    asterisk->>phone: SIP Notify
    phone->>provd: get configuration
